{
  "movies": [
    {
      "id": 1,
      "name": "Avatar",
      "image": "https://i.ebayimg.com/images/g/-dsAAOSwXS5ir7bq/s-l1200.webp",
      "category": "Sci-fi/Action",
      "description": "When his brother is killed in a robbery, paraplegic Marine Jake Sully decides to take his place in a mission on the distant world of Pandora. There he learns of greedy corporate figurehead Parker Selfridge's intentions of driving off the native humanoid Na'vi in order to mine for the precious material scattered throughout their rich woodland. In exchange for the spinal surgery that will fix his legs, Jake gathers knowledge, of the Indigenous Race and their Culture, for the cooperating military unit spearheaded by gung-ho Colonel Quaritch, while simultaneously attempting to infiltrate the Na'vi people with the use of an avatar identity. While Jake begins to bond with the native tribe and quickly falls in love with the beautiful alien Neytiri, the restless Colonel moves forward with his ruthless extermination tactics, forcing the soldier to take a stand - and fight back in an epic battle for the fate of Pandora.",
      "year_released": "2009",
      "box_office_earnings": "$2.93 Billion",
      "director": "James Cameron",
      "main_cast_members": "Sam Worthington, Zoe Saldans, Sigourney Weaver",
      "trailer": "https://www.youtube.com/embed/5PSNL1qE6VY?si=NPtu8148x8T2ETL3"
    },
    {
      "id": 2,
      "name": "Avengers: End Game",
      "image": "https://m.media-amazon.com/images/I/81ExhpBEbHL._AC_UF1000,1000_QL80_.jpg",
      "category": "Sci-fi/Action",
      "description": "After the devastating events of Avengers: Infinity War (2018), the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos's actions and undo the chaos to the universe, no matter what consequences may be in store, and no matter who they face...",
      "year_released": "2019",
      "box_office_earnings": "$2.79 Billion",
      "director": "Anthony Russo, Joe Russo",
      "main_cast_members": "Robert Downey Jr, Chris Evans, Chris Hemsworth",
      "trailer": "https://www.youtube.com/embed/hA6hldpSTF8?si=ndZRx__PU3NJ2tYx"
    },
    {
      "id": 3,
      "name": "Avatar: The Way of Water",
      "image": "https://m.media-amazon.com/images/M/MV5BYjhiNjBlODctY2ZiOC00YjVlLWFlNzAtNTVhNzM1YjI1NzMxXkEyXkFqcGdeQXVyMjQxNTE1MDA@._V1_FMjpg_UX1000_.jpg",
      "category": "Sci-fi/Action",
      "description": "Jake Sully lives with his newfound family formed on the extrasolar moon Pandora. Once a familiar threat returns to finish what was previously started, Jake must work with Neytiri and the army of the Na'vi race to protect their home. Several years after the Na'vi repelled the RDA invasion Jake Sully and his family are living on Pandora. Things seem peaceful but the RDA has other plans, invading and capturing Pandora. Sully forms a guerrilla group to try to expel the invaders.",
      "year_released": "2022",
      "box_office_earnings": "$2.32 Billion",
      "director": "James Cameron",
      "main_cast_members": "Robert Downey Jr, Chris Evans, Chris Hemsworth",
      "trailer": "https://www.youtube.com/embed/d9MyW72ELq0?si=1E1SuTn9EM4OobBX"
    },
    {
      "id": 4,
      "name": "Titanic",
      "image": "https://m.media-amazon.com/images/M/MV5BMDdmZGU3NDQtY2E5My00ZTliLWIzOTUtMTY4ZGI1YjdiNjk3XkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_.jpg",
      "category": "Drama",
      "description": "84 years later, a 100 year-old woman named Rose DeWitt Bukater tells the story to her granddaughter Lizzy Calvert, Brock Lovett, Lewis Bodine, Bobby Buell and Anatoly Mikailavich on the Keldysh about her life set in April 10th 1912, on a ship called Titanic when young Rose boards the departing ship with the upper-class passengers and her mother, Ruth DeWitt Bukater, and her fiancé, Caledon Hockley. Meanwhile, a drifter and artist named Jack Dawson and his best friend Fabrizio De Rossi win third-class tickets to the ship in a game. And she explains the whole story from departure until the death of Titanic on its first and last voyage April 15th, 1912 at 2:20 in the morning.",
      "year_released": "1997",
      "box_office_earnings": "$2.26 Billion",
      "director": "James Cameron",
      "main_cast_members": "Kate Winslet, Leonardo DiCaprio",
      "trailer": "https://www.youtube.com/embed/CHekzSiZjrY?si=i1mpPR5stkfPyp8_"
    },
    {
      "id": 5,
      "name": "Star Wars: The Force Awakens",
      "image": "https://m.media-amazon.com/images/M/MV5BOTAzODEzNDAzMl5BMl5BanBnXkFtZTgwMDU1MTgzNzE@._V1_.jpg",
      "category": "Sci-fi/Action",
      "description": "30 years after the defeat of Darth Vader and the Empire, Rey, a scavenger from the planet Jakku, finds a BB-8 droid that knows the whereabouts of the long lost Luke Skywalker. Rey, as well as a rogue stormtrooper and two smugglers, are thrown into the middle of a battle between the Resistance and the daunting legions of the First Order",
      "year_released": "2015",
      "box_office_earnings": "$2.07 Billion",
      "director": "J.J Abrams",
      "main_cast_members": "Daisy Ridley, Harrison Ford",
      "trailer": "https://www.youtube.com/embed/sGbxmsDFVnE?si=GH-61Yraf-e39Nsl"
    },
    {
      "id": 6,
      "name": "Avengers: Infinity War",
      "image": "https://m.media-amazon.com/images/M/MV5BMjMxNjY2MDU1OV5BMl5BanBnXkFtZTgwNzY1MTUwNTM@._V1_.jpg",
      "category": "Sci-Fi/Action",
      "description": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment, the fate of Earth and existence has never been more uncertain.",
      "year_released": "2018",
      "box_office_earnings": "$2.05 Billion",
      "director": "Anthony Russo, Joe Russo",
      "main_cast_members": "Robert Downey Jr, Chris Evans, Chris Hemsworth",
      "trailer": "https://www.youtube.com/embed/QwievZ1Tx-8?si=nd-Pjx0JSTJBUWB8"
    },
    {
      "id": 7,
      "name": "Spider-Man: No Way Home",
      "image": "https://s3.amazonaws.com/media.thecrimson.com/photos/2021/11/29/194232_1353163.jpeg",
      "category": "Action",
      "description": "Peter Parker's secret identity is revealed to the entire world. Desperate for help, Peter turns to Doctor Strange to make the world forget that he is Spider-Man. The spell goes horribly wrong and shatters the multiverse, bringing in monstrous villains that could destroy the world. When Peter asks for help from Doctor Strange, the stakes become even more dangerous, forcing him to discover what it truly means to be Spider-Man.",
      "year_released": "2021",
      "box_office_earnings": "$1.92 Billion",
      "director": "Jon Watts",
      "main_cast_members": "Tom Holland, Zendaya",
      "trailer": "https://www.youtube.com/embed/rt-2cxAiPJk?si=YGpbvXp5uN-IfQD4"
    },
    {
      "id": 8,
      "name": "Jurassic World",
      "image": "https://pyxis.nymag.com/v1/imgs/1c6/c87/470d2565a6193275e8145aaef3be407b2f-14-jurassic-world.w710.jpg",
      "category": "Sci-Fi/Action",
      "description": "Located off the coast of Costa Rica, the Jurassic World luxury resort provides a habitat for an array of genetically engineered dinosaurs, including the vicious and intelligent Indominus rex. When the massive creature escapes, it sets off a chain reaction that causes the other dinos to run amok. Now, it's up to a former military man and animal expert (Chris Pratt) to use his special skills to save two young brothers and the rest of the tourists from an all-out, prehistoric assault.",
      "year_released": "2015",
      "box_office_earnings": "$1.67 Billion",
      "director": "Colin Trevorrow",
      "main_cast_members": "Bryce Howard, Chris Pratt",
      "trailer": "https://www.youtube.com/embed/RFinNxS5KN4?si=imLOKf_armEytaVh"
    },
    {
      "id": 9,
      "name": "The Lion King",
      "image": "https://m.media-amazon.com/images/M/MV5BMjIwMjE1Nzc4NV5BMl5BanBnXkFtZTgwNDg4OTA1NzM@._V1_.jpg",
      "category": "Drama",
      "description": "Simba idolizes his father, King Mufasa, and takes to heart his own royal destiny on the plains of Africa. But not everyone in the kingdom celebrates the new cub's arrival. Scar, Mufasa's brother -- and former heir to the throne -- has plans of his own. The battle for Pride Rock is soon ravaged with betrayal, tragedy and drama, ultimately resulting in Simba's exile. Now, with help from a curious pair of newfound friends, Simba must figure out how to grow up and take back what is rightfully his.",
      "year_released": "2019",
      "box_office_earnings": "$1.66 Billion",
      "director": "Jon Favreau",
      "main_cast_members": "James Jones, Donald Glover",
      "trailer": "https://www.youtube.com/embed/7TavVZMewpY?si=u7XpOxZ_YigzXs6G"
    },
    {
      "id": 10,
      "name": "The Avengers",
      "image": "https://filmartgallery.com/cdn/shop/products/The-Avengers-Vintage-Movie-Poster-Original-French-1-Panel-47x63.jpg?v=1663224709",
      "category": "Sci-Fi/Action",
      "description": "Loki, the adopted brother of Thor, teams-up with the Chitauri Army and uses the Tesseract's power to travel from Asgard to Midgard to plot the invasion of Earth and become a king. The director of the agency S.H.I.E.L.D., Nick Fury, sets in motion project Avengers, joining Tony Stark a.k.a. the Iron Man; Steve Rogers, a.k.a. Captain America; Bruce Banner, a.k.a. The Hulk; Thor; Natasha Romanoff, a.k.a. Black Widow; and Clint Barton, a.k.a. Hawkeye, to save the world from the powerful Loki and the alien invasion.",
      "year_released": "2012",
      "box_office_earnings": "$1.52 Billion",
      "director": "Joss Whendon",
      "main_cast_members": "Scarlett Johansson, Jeremy Renner, Robert Downey Jr.",
      "trailer": "https://www.youtube.com/embed/eOrNdBpGMv8?si=CjAlwfZLMGlmLQkX"
    },
    {
      "id": 11,
      "name": "Furious 7",
      "image": "https://m.media-amazon.com/images/I/81ClciXon2L._AC_UF1000,1000_QL80_.jpg",
      "category": "Action",
      "description": "Dominic and his crew thought they'd left the criminal mercenary life behind. They'd defeated international terrorist Owen Shaw and went their separate ways. But now, Shaw's brother, Deckard Shaw, is out killing the crew one by one for revenge. Worse, a Somalian terrorist called Jakarde and a shady government official called Mr. Nobody are both competing to steal a computer terrorism program called God's Eye, that can turn any technological device into a weapon. Torretto must reconvene with his team to stop Shaw and retrieve the God's Eye program while caught in a power struggle between the terrorist and the United States government.",
      "year_released": "2015",
      "box_office_earnings": "$1.51 Billion",
      "director": "James Wan",
      "main_cast_members": "Paul Walker, Vin Diesel",
      "trailer": "https://www.youtube.com/embed/Skpu5HaVkOc?si=DXy4U6v9cas3cTPK"
    },
    {
      "id": 12,
      "name": "Top Gun: Maverick",
      "image": "https://m.media-amazon.com/images/M/MV5BZWYzOGEwNTgtNWU3NS00ZTQ0LWJkODUtMmVhMjIwMjA1ZmQwXkEyXkFqcGdeQXVyMjkwOTAyMDU@._V1_.jpg",
      "category": "Action",
      "description": "Set 30 years after its predecessor, it follows Maverick's return to the United States Navy Strike Fighter Tactics Instructor program (also known as U.S. Navy-Fighter Weapons School - TOPGUN), where he must confront his past as he trains a group of younger pilots, among them the son of Maverick's deceased best friend Lieutenant Nick Goose Bradshaw, USN.",
      "year_released": "2022",
      "box_office_earnings": "$1.49 Billion",
      "director": "Joseph Kosinski",
      "main_cast_members": "Tom Cruise, Miles Teller",
      "trailer": "https://www.youtube.com/embed/qSqVVswa420?si=Fv5rbDnkgaS1kvXs"
    },
    {
      "id": 13,
      "name": "Frozen 2",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA0YjYyZGMtN2U0Ni00YmY4LWJkZTItYTMyMjY3NGYyMTJkXkEyXkFqcGdeQXVyNDg4NjY5OTQ@._V1_.jpg",
      "category": "Drama",
      "description": "Having harnessed her ever-growing power after lifting the dreadful curse of eternal winter in Frozen (2013), Queen Elsa, the grand conjurer of snow and ice, and her sister, Princess Anna, now enjoy a happy life in the peaceful kingdom of Arendelle. However, a melodious, insistent voice only Elsa can hear keeps her awake, inviting the Snow Queen to a fabled mystical forest. As a result, unable to block the thrilling call of the secret siren, Elsa follows the voice into the perpetually misty realm in the woods to find answers. But, more and more, an inexplicable imbalance hurts her kingdom and the neighboring tribe of Northuldra. Is Queen Elsa's legendary magic enough to restore peace and stability?",
      "year_released": "2019",
      "box_office_earnings": "$1.45 Billion",
      "director": "Jennifer Lee, Chris Buck",
      "main_cast_members": "Kristen Bell, Idina Menzel",
      "trailer": "https://www.youtube.com/embed/Zi4LMpSDccc?si=yuNCMvfYKGU-qsc0"
    },
    {
      "id": 14,
      "name": "Avengers: Age of Ultron",
      "image": "https://m.media-amazon.com/images/M/MV5BMTM4OGJmNWMtOTM4Ni00NTE3LTg3MDItZmQxYjc4N2JhNmUxXkEyXkFqcGdeQXVyNTgzMDMzMTg@._V1_.jpg",
      "category": "Sci-Fi/Action",
      "description": "When Tony Stark (Robert Downey Jr.) jump-starts a dormant peacekeeping program, things go terribly awry, forcing him, Thor (Chris Hemsworth), the Incredible Hulk (Mark Ruffalo) and the rest of the Avengers to reassemble. As the fate of Earth hangs in the balance, the team is put to the ultimate test as they battle Ultron, a technological terror hell-bent on human extinction. Along the way, they encounter two mysterious and powerful newcomers, Pietro and Wanda Maximoff.",
      "year_released": "2015",
      "box_office_earnings": "$1.40 Billion",
      "director": "Joss Whendon",
      "main_cast_members": "Robert Downey Jr., Chris Evans, Scarlett Johansson",
      "trailer": "https://www.youtube.com/embed/tmeOjFno6Do?si=8d_zOszqiodhnbIk"
    },
    {
      "id": 15,
      "name": "Black Panther",
      "image": "https://m.media-amazon.com/images/M/MV5BYzVhZDYzNzYtZTJhZi00ZDIzLTg2YmEtNGQyMmI1NzJlMmMyXkEyXkFqcGdeQXVyNzg0NTkwNTU@._V1_.jpg",
      "category": "Action",
      "description": "After the events of Captain America: Civil War, Prince T'Challa returns home to the reclusive, technologically advanced African nation of Wakanda to serve as his country's new king. However, T'Challa soon finds that he is challenged for the throne from factions within his own country. When two foes conspire to destroy Wakanda, the hero known as Black Panther must team up with C.I.A. agent Everett K. Ross and members of the Dora Milaje, Wakandan special forces, to prevent Wakanda from being dragged into a world war.",
      "year_released": "2018",
      "box_office_earnings": "$1.34 Billion",
      "director": "Ryan Coogler",
      "main_cast_members": "Chadwick Boseman, Michael B. Jordan",
      "trailer": "https://www.youtube.com/embed/xjDjIWPwcPU?si=FJBe_nJRayGmSzJ7"
    }
  ]
}